#### Importations

In [3]:
import pandas as pd

#### Data loading

In [4]:

links = pd.read_csv("../ml-latest-small/links.csv")
movies = pd.read_csv("../ml-latest-small/movies.csv")
ratings = pd.read_csv("../ml-latest-small/ratings.csv")
tags = pd.read_csv("../ml-latest-small/tags.csv")

### Data Exploring

#### Raw and Column viewing

In [5]:
links.head(3)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0

In [6]:
movies.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [7]:
ratings.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [8]:
tags.head(3)

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992

#### Shape of the various Dataframes

In [9]:
print(f'Links shape: {links.shape}')
print(f'Movies shape: {movies.shape}')
print(f'Ratings shape: {ratings.shape}')
print(f'Tags shape: {tags.shape}')

Links shape: (9742, 3)
Movies shape: (9742, 3)
Ratings shape: (100836, 4)
Tags shape: (3683, 4)

#### Summary information for the Dataframes

In [10]:
print(links.info())
print(movies.info())
print(ratings.info())
print(tags.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   imdbId   9742 non-null   int64
 2   tmdbId   9734 non-null   float64
dtypes: float64(1), int64(2)
memory usage: 228.5 KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3683 entries, 0 to 3682
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   userId     3683 non-null   int64
 1   movieId    3683 non-null   int64
 2   tag        3683 non-null   object
 3   timestamp  3683 non-null   int64
dtypes: int64(3), object(1)
memory usage: 115.2+ KB
None

#### missing Values

In [11]:
print(links.isnull().sum())
print(movies.isnull().sum())
print(ratings.isnull().sum())
print(tags.isnull().sum())

movieId    0
imdbId     0
tmdbId     8
dtype: int64
movieId    0
title      0
genres     0
dtype: int64
userId       0
movieId      0
rating       0
timestamp    0
dtype: int64
userId       0
movieId      0
tag          0
timestamp    0
dtype: int64

Exploration is able to tell us that tmbId of 8 particulars are missing. By domain knowlegde ID is a unique symbolization for a particular therefore the missing values are dropped

In [14]:
links = links.dropna()
print(links.isnull().sum())

movieId    0
imdbId     0
tmdbId     0
dtype: int64

### Data Understanding

>Links Data

Contains mappings between movie IDs in the MovieLens dataset and external IDs (like IMDb).

Columns: movieId, imdbId, tmdbId

>Movies Data

has movie metadata.

Columns: 

movieId: identifier for the movie.

title: movie name.

genres: list of genres.